Revit 2027 API
ParameterTypeId.SweepTrajSegmented Property
 "Trajectory Segmentation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SweepTrajSegmented { get; }
Public Shared ReadOnly Property SweepTrajSegmented As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SweepTrajSegmented {
	ForgeTypeId^ get ();
}
static member SweepTrajSegmented : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace